data-asplos/themis-conf/lighttpd-100.txt
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.15ms    1.37ms  21.59ms   91.95%
    Req/Sec     5.38k   273.56    10.48k    86.31%
  7711992 requests in 2.00m, 2.26GB read
Requests/sec:  64228.14
Transfer/sec:     19.31MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.32ms    1.39ms  23.12ms   93.12%
    Req/Sec     5.24k   301.17    32.43k    92.07%
  7509432 requests in 2.00m, 2.20GB read
Requests/sec:  62526.76
Transfer/sec:     18.79MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.40ms    1.43ms  17.13ms   92.44%
    Req/Sec     5.18k   300.95     9.52k    87.00%
  7419649 requests in 2.00m, 2.18GB read
Requests/sec:  61798.19
Transfer/sec:     18.58MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.32ms    1.41ms  20.32ms   92.63%
    Req/Sec     5.24k   238.09     9.87k    79.48%
  7503763 requests in 2.00m, 2.20GB read
Requests/sec:  62494.63
Transfer/sec:     18.79MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.37ms    1.39ms  25.15ms   93.35%
    Req/Sec     5.20k   268.98    21.46k    88.97%
  7449611 requests in 2.00m, 2.19GB read
Requests/sec:  62028.34
Transfer/sec:     18.64MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.08ms    1.51ms  13.78ms   85.63%
    Req/Sec     5.45k   499.44    10.21k    79.82%
  7808664 requests in 2.00m, 2.29GB read
Requests/sec:  65028.05
Transfer/sec:     19.55MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.44ms    1.58ms  13.64ms   82.37%
    Req/Sec     6.09k   544.33    26.28k    72.16%
  8720820 requests in 2.00m, 2.56GB read
Requests/sec:  72613.14
Transfer/sec:     21.83MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.31ms   17.89ms 870.59ms   99.65%
    Req/Sec     6.11k   577.53    11.52k    68.65%
  8738499 requests in 2.00m, 2.57GB read
Requests/sec:  72784.51
Transfer/sec:     21.88MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.54ms    1.56ms  21.24ms   82.48%
    Req/Sec     5.98k   569.62     9.95k    66.12%
  8568639 requests in 2.00m, 2.52GB read
Requests/sec:  71364.99
Transfer/sec:     21.45MB
Running 2m test @ http://128.178.116.199:6380/random/100.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.28ms    1.40ms  22.14ms   91.89%
    Req/Sec     5.27k   349.19    31.65k    93.25%
  7554908 requests in 2.00m, 2.22GB read
Requests/sec:  62905.47
Transfer/sec:     18.91MB